# Machinelearning Labb

*by Hannes*

## 0. Imports

In [154]:
import pandas as pd
from IPython.display import display, Markdown

## 1.1 Movielens EDA

In [155]:
# Paths to the Data
movies_df = pd.read_csv('Data/movies.csv')
ratings_df = pd.read_csv('Data/ratings.csv')

### 1.1.1 EDA Movies

In [156]:
movies_df.sample(5)

       movieId                         title            genres
15797    83270       Made in Dagenham (2010)      Comedy|Drama
24418   121328  All Things Fall Apart (2011)             Drama
41338   160537       Deadly Sanctuary (2015)  Mystery|Thriller
73331   238006        Escape Velocity (1999)     Action|Sci-Fi
22742   116060     Code Name: Emerald (1985)  Action|Drama|War

In [157]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [158]:
movies_df.tail()

,movieId,title,genres
86532,288967,State of Siege: Temple Attack (2021),Action|Drama
86533,288971,Ouija Japan (2021),Action|Horror
86534,288975,The Men Who Made the Movies: Howard Hawks (1973),Documentary
86535,288977,Skinford: Death Sentence (2023),Crime|Thriller
86536,288983,UNZIPPED: An Autopsy of American Inequality (2...,Documentary

In [159]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86537 entries, 0 to 86536
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  86537 non-null  int64
 1   title    86537 non-null  object
 2   genres   86537 non-null  object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [160]:
movies_df.shape

(86537, 3)

In [161]:
movies_df.describe()

             movieId
count   86537.000000
mean   155932.817096
std     78037.145347
min         1.000000
25%    111443.000000
50%    164574.000000
75%    211225.000000
max    288983.000000

In [162]:
movies_df.columns

Index(['movieId', 'title', 'genres'], dtype='object')

In [163]:
movies_df.dtypes

movieId     int64
title      object
genres     object
dtype: object

In [164]:
movies_df.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [165]:
movies_df.nunique()

movieId    86537
title      86330
genres      1796
dtype: int64

### 1.1.2 EDA Ratings

In [166]:
ratings_df.sample(5)

          userId  movieId  rating   timestamp
32801692  320658     2424     3.0  1495514364
9263400    91013      733     3.5  1300460577
649451      6268     6155     4.5  1475707193
13349865  131165    71537     2.5  1524429294
23953182  233321      300     3.0   944975350

In [167]:
ratings_df.head()

   userId  movieId  rating   timestamp
0       1        1     4.0  1225734739
1       1      110     4.0  1225865086
2       1      158     4.0  1225733503
3       1      260     4.5  1225735204
4       1      356     5.0  1225735119

In [168]:
ratings_df.tail()

          userId  movieId  rating   timestamp
33832157  330975     8340     2.0  1091583256
33832158  330975     8493     2.5  1091585709
33832159  330975     8622     4.0  1091581777
33832160  330975     8665     3.0  1091581765
33832161  330975     8783     2.5  1091581799

In [169]:
ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33832162 entries, 0 to 33832161
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 1.0 GB

In [170]:
ratings_df.shape

(33832162, 4)

In [171]:
ratings_df.describe()

             userId       movieId        rating     timestamp
count  3.383216e+07  3.383216e+07  3.383216e+07  3.383216e+07
mean   1.654380e+05  2.831348e+04  3.542540e+00  1.269362e+09
std    9.534122e+04  4.992865e+04  1.063959e+00  2.541023e+08
min    1.000000e+00  1.000000e+00  5.000000e-01  7.896520e+08
25%    8.295300e+04  1.219000e+03  3.000000e+00  1.046718e+09
50%    1.661290e+05  3.263000e+03  4.000000e+00  1.264740e+09
75%    2.474500e+05  4.049100e+04  4.000000e+00  1.496919e+09
max    3.309750e+05  2.889830e+05  5.000000e+00  1.689843e+09

In [172]:
ratings_df.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [173]:
ratings_df.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

In [174]:
ratings_df.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [175]:
ratings_df.nunique()

userId         330975
movieId         83239
rating             10
timestamp    27419646
dtype: int64

### 1.1.3 Q:A

A) Top 10 movies with most amount of ratings

B) Calculate the avrage rating for the 10 movies with most ratings

In [179]:
# Count the number of ratings for each movie
ratings_count = ratings_df.groupby('movieId').size().reset_index(name='count')

# Merge with movies_df to get movie titles
movies_with_ratings_count = pd.merge(movies_df, ratings_count, on='movieId')

# Sort movies by the number of ratings in descending order and get the top 10
top_movies = movies_with_ratings_count.sort_values('count', ascending=False).head(10)

# Calculate the average rating for the top movies and round to one decimal place
average_ratings = ratings_df[ratings_df['movieId'].isin(top_movies['movieId'])] \
                    .groupby('movieId')['rating'].mean().round(1).reset_index()

# Add the average ratings to the top_movies DataFrame
top_movies_with_avg_ratings = pd.merge(top_movies, average_ratings, on='movieId')

# Reset the index to start from 1 for display purposes and rename columns for presentation
top_movies_with_avg_ratings.reset_index(drop=True, inplace=True)
top_movies_with_avg_ratings['count'] = top_movies_with_avg_ratings['count'].apply(lambda x: "{:,}".format(x))
top_movies_with_avg_ratings.rename(columns={'title': 'Movie Title', 'count': 'Rating Count', 'rating': 'Average Rating'}, inplace=True)
top_movies_with_avg_ratings.index += 1  # Adjust index to start from 1

# Generate the Markdown table
markdown_table = "| Rank | Movie Title | Rating Count | Average Rating |\n"
markdown_table += "|------|-------------|--------------|----------------|\n"

# Fill the table with data from the DataFrame
for index, row in top_movies_with_avg_ratings.iterrows():
    markdown_table += f"| {index} | {row['Movie Title']} | {row['Rating Count']} | {row['Average Rating']} |\n"

# Display the Markdown table in Jupyter Notebook
display(Markdown(markdown_table))

| Rank | Movie Title | Rating Count | Average Rating |
|------|-------------|--------------|----------------|
| 1 | Shawshank Redemption, The (1994) | 122,296 | 4.4 |
| 2 | Forrest Gump (1994) | 113,581 | 4.1 |
| 3 | Pulp Fiction (1994) | 108,756 | 4.2 |
| 4 | Matrix, The (1999) | 107,056 | 4.2 |
| 5 | Silence of the Lambs, The (1991) | 101,802 | 4.2 |
| 6 | Star Wars: Episode IV - A New Hope (1977) | 97,202 | 4.1 |
| 7 | Fight Club (1999) | 86,207 | 4.2 |
| 8 | Schindler's List (1993) | 84,232 | 4.2 |
| 9 | Jurassic Park (1993) | 83,026 | 3.7 |
| 10 | Star Wars: Episode V - The Empire Strikes Back (1980) | 80,200 | 4.1 |